sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/isi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_IDR_OFFSET                      (0x30)                                        /**<  (ISI_IDR) ISI Interrupt Disable Register  Offset */

#define ISI_IDR_DIS_DONE_Pos                1                                              /**< (ISI_IDR) Disable Done Interrupt Disable Position */
#define ISI_IDR_DIS_DONE_Msk                (_U_(0x1) << ISI_IDR_DIS_DONE_Pos)             /**< (ISI_IDR) Disable Done Interrupt Disable Mask */
#define ISI_IDR_DIS_DONE                    ISI_IDR_DIS_DONE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_DIS_DONE_Msk instead */
#define ISI_IDR_SRST_Pos                    2                                              /**< (ISI_IDR) Software Reset Interrupt Disable Position */
#define ISI_IDR_SRST_Msk                    (_U_(0x1) << ISI_IDR_SRST_Pos)                 /**< (ISI_IDR) Software Reset Interrupt Disable Mask */
#define ISI_IDR_SRST                        ISI_IDR_SRST_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_SRST_Msk instead */
#define ISI_IDR_VSYNC_Pos                   10                                             /**< (ISI_IDR) Vertical Synchronization Interrupt Disable Position */
#define ISI_IDR_VSYNC_Msk                   (_U_(0x1) << ISI_IDR_VSYNC_Pos)                /**< (ISI_IDR) Vertical Synchronization Interrupt Disable Mask */
#define ISI_IDR_VSYNC                       ISI_IDR_VSYNC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_VSYNC_Msk instead */
#define ISI_IDR_PXFR_DONE_Pos               16                                             /**< (ISI_IDR) Preview DMA Transfer Done Interrupt Disable Position */
#define ISI_IDR_PXFR_DONE_Msk               (_U_(0x1) << ISI_IDR_PXFR_DONE_Pos)            /**< (ISI_IDR) Preview DMA Transfer Done Interrupt Disable Mask */
#define ISI_IDR_PXFR_DONE                   ISI_IDR_PXFR_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_PXFR_DONE_Msk instead */
#define ISI_IDR_CXFR_DONE_Pos               17                                             /**< (ISI_IDR) Codec DMA Transfer Done Interrupt Disable Position */
#define ISI_IDR_CXFR_DONE_Msk               (_U_(0x1) << ISI_IDR_CXFR_DONE_Pos)            /**< (ISI_IDR) Codec DMA Transfer Done Interrupt Disable Mask */
#define ISI_IDR_CXFR_DONE                   ISI_IDR_CXFR_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_CXFR_DONE_Msk instead */
#define ISI_IDR_P_OVR_Pos                   24                                             /**< (ISI_IDR) Preview Datapath Overflow Interrupt Disable Position */
#define ISI_IDR_P_OVR_Msk                   (_U_(0x1) << ISI_IDR_P_OVR_Pos)                /**< (ISI_IDR) Preview Datapath Overflow Interrupt Disable Mask */
#define ISI_IDR_P_OVR                       ISI_IDR_P_OVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_P_OVR_Msk instead */
#define ISI_IDR_C_OVR_Pos                   25                                             /**< (ISI_IDR) Codec Datapath Overflow Interrupt Disable Position */
#define ISI_IDR_C_OVR_Msk                   (_U_(0x1) << ISI_IDR_C_OVR_Pos)                /**< (ISI_IDR) Codec Datapath Overflow Interrupt Disable Mask */
#define ISI_IDR_C_OVR                       ISI_IDR_C_OVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_C_OVR_Msk instead */
#define ISI_IDR_CRC_ERR_Pos                 26                                             /**< (ISI_IDR) Embedded Synchronization CRC Error Interrupt Disable Position */
#define ISI_IDR_CRC_ERR_Msk                 (_U_(0x1) << ISI_IDR_CRC_ERR_Pos)              /**< (ISI_IDR) Embedded Synchronization CRC Error Interrupt Disable Mask */
#define ISI_IDR_CRC_ERR                     ISI_IDR_CRC_ERR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_CRC_ERR_Msk instead */
#define ISI_IDR_FR_OVR_Pos                  27                                             /**< (ISI_IDR) Frame Rate Overflow Interrupt Disable Position */
#define ISI_IDR_FR_OVR_Msk                  (_U_(0x1) << ISI_IDR_FR_OVR_Pos)               /**< (ISI_IDR) Frame Rate Overflow Interrupt Disable Mask */
#define ISI_IDR_FR_OVR                      ISI_IDR_FR_OVR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IDR_FR_OVR_Msk instead */
#define ISI_IDR_MASK                        _U_(0xF030406)                                 /**< \deprecated (ISI_IDR) Register MASK  (Use ISI_IDR_Msk instead)  */
#define ISI_IDR_Msk                         _U_(0xF030406)                                 /**< (ISI_IDR) Register Mask  */


/* -------- ISI_IMR : (ISI Offset: 0x34) (R/ 32) ISI Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t DIS_DONE:1;                /**< bit:      1  Module Disable Operation Completed       */
    uint32_t SRST:1;                    /**< bit:      2  Software Reset Completed                 */
    uint32_t :7;                        /**< bit:   3..9  Reserved */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization                 */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer Completed           */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer Completed             */
    uint32_t :6;                        /**< bit: 18..23  Reserved */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview FIFO Overflow                    */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec FIFO Overflow                      */
    uint32_t CRC_ERR:1;                 /**< bit:     26  CRC Synchronization Error                */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overrun                       */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_IMR_Type;
