sapphireos/chromatron/src/hal/sams70/arm/sams70a/include/component/isi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_WPSR_OFFSET                     (0xE8)                                        /**<  (ISI_WPSR) Write Protection Status Register  Offset */

#define ISI_WPSR_WPVS_Pos                   0                                              /**< (ISI_WPSR) Write Protection Violation Status Position */
#define ISI_WPSR_WPVS_Msk                   (_U_(0x1) << ISI_WPSR_WPVS_Pos)                /**< (ISI_WPSR) Write Protection Violation Status Mask */
#define ISI_WPSR_WPVS                       ISI_WPSR_WPVS_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_WPSR_WPVS_Msk instead */
#define ISI_WPSR_WPVSRC_Pos                 8                                              /**< (ISI_WPSR) Write Protection Violation Source Position */
#define ISI_WPSR_WPVSRC_Msk                 (_U_(0xFFFF) << ISI_WPSR_WPVSRC_Pos)           /**< (ISI_WPSR) Write Protection Violation Source Mask */
#define ISI_WPSR_WPVSRC(value)              (ISI_WPSR_WPVSRC_Msk & ((value) << ISI_WPSR_WPVSRC_Pos))
#define ISI_WPSR_MASK                       _U_(0xFFFF01)                                  /**< \deprecated (ISI_WPSR) Register MASK  (Use ISI_WPSR_Msk instead)  */
#define ISI_WPSR_Msk                        _U_(0xFFFF01)                                  /**< (ISI_WPSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief ISI hardware registers */
typedef struct {  
  __IO uint32_t ISI_CFG1;       /**< (ISI Offset: 0x00) ISI Configuration 1 Register */
  __IO uint32_t ISI_CFG2;       /**< (ISI Offset: 0x04) ISI Configuration 2 Register */
  __IO uint32_t ISI_PSIZE;      /**< (ISI Offset: 0x08) ISI Preview Size Register */
  __IO uint32_t ISI_PDECF;      /**< (ISI Offset: 0x0C) ISI Preview Decimation Factor Register */
  __IO uint32_t ISI_Y2R_SET0;   /**< (ISI Offset: 0x10) ISI Color Space Conversion YCrCb To RGB Set 0 Register */
  __IO uint32_t ISI_Y2R_SET1;   /**< (ISI Offset: 0x14) ISI Color Space Conversion YCrCb To RGB Set 1 Register */
  __IO uint32_t ISI_R2Y_SET0;   /**< (ISI Offset: 0x18) ISI Color Space Conversion RGB To YCrCb Set 0 Register */
  __IO uint32_t ISI_R2Y_SET1;   /**< (ISI Offset: 0x1C) ISI Color Space Conversion RGB To YCrCb Set 1 Register */
  __IO uint32_t ISI_R2Y_SET2;   /**< (ISI Offset: 0x20) ISI Color Space Conversion RGB To YCrCb Set 2 Register */
  __O  uint32_t ISI_CR;         /**< (ISI Offset: 0x24) ISI Control Register */
  __I  uint32_t ISI_SR;         /**< (ISI Offset: 0x28) ISI Status Register */
  __O  uint32_t ISI_IER;        /**< (ISI Offset: 0x2C) ISI Interrupt Enable Register */
  __O  uint32_t ISI_IDR;        /**< (ISI Offset: 0x30) ISI Interrupt Disable Register */
  __I  uint32_t ISI_IMR;        /**< (ISI Offset: 0x34) ISI Interrupt Mask Register */
  __O  uint32_t ISI_DMA_CHER;   /**< (ISI Offset: 0x38) DMA Channel Enable Register */
  __O  uint32_t ISI_DMA_CHDR;   /**< (ISI Offset: 0x3C) DMA Channel Disable Register */
  __I  uint32_t ISI_DMA_CHSR;   /**< (ISI Offset: 0x40) DMA Channel Status Register */
  __IO uint32_t ISI_DMA_P_ADDR; /**< (ISI Offset: 0x44) DMA Preview Base Address Register */
  __IO uint32_t ISI_DMA_P_CTRL; /**< (ISI Offset: 0x48) DMA Preview Control Register */
  __IO uint32_t ISI_DMA_P_DSCR; /**< (ISI Offset: 0x4C) DMA Preview Descriptor Address Register */
  __IO uint32_t ISI_DMA_C_ADDR; /**< (ISI Offset: 0x50) DMA Codec Base Address Register */
  __IO uint32_t ISI_DMA_C_CTRL; /**< (ISI Offset: 0x54) DMA Codec Control Register */
  __IO uint32_t ISI_DMA_C_DSCR; /**< (ISI Offset: 0x58) DMA Codec Descriptor Address Register */
  RoReg8  Reserved1[0x88];
  __IO uint32_t ISI_WPMR;       /**< (ISI Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t ISI_WPSR;       /**< (ISI Offset: 0xE8) Write Protection Status Register */
} Isi;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief ISI hardware registers */
typedef struct {  
  __IO ISI_CFG1_Type                  ISI_CFG1;       /**< Offset: 0x00 (R/W  32) ISI Configuration 1 Register */
  __IO ISI_CFG2_Type                  ISI_CFG2;       /**< Offset: 0x04 (R/W  32) ISI Configuration 2 Register */
  __IO ISI_PSIZE_Type                 ISI_PSIZE;      /**< Offset: 0x08 (R/W  32) ISI Preview Size Register */
  __IO ISI_PDECF_Type                 ISI_PDECF;      /**< Offset: 0x0C (R/W  32) ISI Preview Decimation Factor Register */
  __IO ISI_Y2R_SET0_Type              ISI_Y2R_SET0;   /**< Offset: 0x10 (R/W  32) ISI Color Space Conversion YCrCb To RGB Set 0 Register */
  __IO ISI_Y2R_SET1_Type              ISI_Y2R_SET1;   /**< Offset: 0x14 (R/W  32) ISI Color Space Conversion YCrCb To RGB Set 1 Register */
  __IO ISI_R2Y_SET0_Type              ISI_R2Y_SET0;   /**< Offset: 0x18 (R/W  32) ISI Color Space Conversion RGB To YCrCb Set 0 Register */
  __IO ISI_R2Y_SET1_Type              ISI_R2Y_SET1;   /**< Offset: 0x1C (R/W  32) ISI Color Space Conversion RGB To YCrCb Set 1 Register */
  __IO ISI_R2Y_SET2_Type              ISI_R2Y_SET2;   /**< Offset: 0x20 (R/W  32) ISI Color Space Conversion RGB To YCrCb Set 2 Register */
  __O  ISI_CR_Type                    ISI_CR;         /**< Offset: 0x24 ( /W  32) ISI Control Register */
  __I  ISI_SR_Type                    ISI_SR;         /**< Offset: 0x28 (R/   32) ISI Status Register */
  __O  ISI_IER_Type                   ISI_IER;        /**< Offset: 0x2C ( /W  32) ISI Interrupt Enable Register */
  __O  ISI_IDR_Type                   ISI_IDR;        /**< Offset: 0x30 ( /W  32) ISI Interrupt Disable Register */
  __I  ISI_IMR_Type                   ISI_IMR;        /**< Offset: 0x34 (R/   32) ISI Interrupt Mask Register */
  __O  ISI_DMA_CHER_Type              ISI_DMA_CHER;   /**< Offset: 0x38 ( /W  32) DMA Channel Enable Register */
  __O  ISI_DMA_CHDR_Type              ISI_DMA_CHDR;   /**< Offset: 0x3C ( /W  32) DMA Channel Disable Register */
  __I  ISI_DMA_CHSR_Type              ISI_DMA_CHSR;   /**< Offset: 0x40 (R/   32) DMA Channel Status Register */
  __IO ISI_DMA_P_ADDR_Type            ISI_DMA_P_ADDR; /**< Offset: 0x44 (R/W  32) DMA Preview Base Address Register */
  __IO ISI_DMA_P_CTRL_Type            ISI_DMA_P_CTRL; /**< Offset: 0x48 (R/W  32) DMA Preview Control Register */
  __IO ISI_DMA_P_DSCR_Type            ISI_DMA_P_DSCR; /**< Offset: 0x4C (R/W  32) DMA Preview Descriptor Address Register */
  __IO ISI_DMA_C_ADDR_Type            ISI_DMA_C_ADDR; /**< Offset: 0x50 (R/W  32) DMA Codec Base Address Register */
  __IO ISI_DMA_C_CTRL_Type            ISI_DMA_C_CTRL; /**< Offset: 0x54 (R/W  32) DMA Codec Control Register */
  __IO ISI_DMA_C_DSCR_Type            ISI_DMA_C_DSCR; /**< Offset: 0x58 (R/W  32) DMA Codec Descriptor Address Register */
  __I  uint32_t                       Reserved1[34];
  __IO ISI_WPMR_Type                  ISI_WPMR;       /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  ISI_WPSR_Type                  ISI_WPSR;       /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} Isi;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Image Sensor Interface */

#endif /* _SAMS70_ISI_COMPONENT_H_ */
